{
  "projects": [
    {
      "id": "project-1",
      "title": "Predictive Analysis of NFL Running Backs",
      "description": "Conducted a predictive analysis of NFL running backs’ performance using historical data, focusing on key metrics. Developed and deployed machine learning models, including Random Forest and Gradient Boosting, achieving 15% higher prediction accuracy.",
      "technologies": "Altair AI, RapidMiner, Tableau, Python",
      "githubUrl": "https://github.com"
    },
    {
      "id": "project-2",
      "title": "Claims Management System",
      "description": "Designed and developed a full-stack claims management system to streamline healthcare workflows. Built a secure backend using .NET Core and SQL Server, with a responsive Angular frontend. Deployed on GCP.",
      "technologies": ".NET Core, SQL Server, Angular, GCP, RESTful APIs, Git",
      "githubUrl": "https://github.com"
    },
    {
      "id": "project-3",
      "title": "Big Data Analytics Project",
      "description": "Designed and implemented a Big Data processing solution using Apache Cassandra to manage and query large volumes of distributed data efficiently. Focused on scalability and high availability.",
      "technologies": "Apache Cassandra, NoSQL, Data Modeling, Tableau, Python",
      "githubUrl": "https://github.com"
    },
    {
      "id": "project-4",
      "title": "RFM Model based clustering analysis",
      "description": "Applied the RFM (Recency, Frequency, Monetary) model to segment customers into meaningful clusters using K-Means clustering, leading to 20% improved marketing personalization and customer retention.",
      "technologies": "Python, Pandas, Altair AI, RapidMiner, Tableau",
      "githubUrl": "https://github.com"
    },
    {
      "id": "project-5",
      "title": "Cloud-Based Data Warehouse using Snowflake",
      "description": "Designed and implemented a scalable cloud-based data warehouse solution for a healthcare client using Snowflake. Automated ETL pipelines using Azure Data Factory.",
      "technologies": "Snowflake, SQL, AWS, Python, Tableau, ETL tools",
      "githubUrl": "https://github.com"
    },
    {
      "id": "project-6",
      "title": "Symptom Analysis for Monkeypox Diagnosis",
      "description": "Analyzed patient health data to identify key symptoms of monkeypox outbreaks. Applied machine learning models to improve diagnostic accuracy by 25%.",
      "technologies": "Python, RapidMiner, Tableau, Decision Trees, Logistic Regression",
      "githubUrl": "https://github.com"
    }
  ]
}